Config/InformationRegisters/СоответствиеКПСПриПереносеОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеКПСПриПереносеОстатков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НовыйКПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗамены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтарыйКПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СоответствиеКПСПриПереносеОстатков/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СоответствиеКПС(СтарыеКПС, Дата) Экспорт
	
	СоответствиеКПС = Новый Соответствие;
	
	Если СтарыеКПС.Количество() = 0 Тогда
		Возврат СоответствиеКПС;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствиеКПСПриПереносеОстатков.СтарыйКПС КАК СтарыйКПС,
	|	СоответствиеКПСПриПереносеОстатков.НовыйКПС КАК НовыйКПС
	|ИЗ
	|	РегистрСведений.СоответствиеКПСПриПереносеОстатков КАК СоответствиеКПСПриПереносеОстатков
	|ГДЕ
	|	СоответствиеКПСПриПереносеОстатков.ДатаЗамены <= &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	СтарыйКПСНовыйКПС = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтарыйКПСНовыйКПС.Вставить(Выборка.СтарыйКПС, Выборка.НовыйКПС);
	КонецЦикла;
	
	Для Каждого СтарыйКПС Из СтарыеКПС Цикл
		ТекущийКПС = СтарыйКПС.Ключ;
		Пока СтарыйКПСНовыйКПС[ТекущийКПС] <> Неопределено Цикл
			ТекущийКПС = СтарыйКПСНовыйКПС[ТекущийКПС];
		КонецЦикла;
		Если СтарыйКПС.Ключ <> ТекущийКПС Тогда
			СоответствиеКПС.Вставить(СтарыйКПС.Ключ, ТекущийКПС);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СоответствиеКПС;
	
КонецФункции

Процедура ЗаменитьКПСвТаблицахСУчетомПереносаОстатковПоКПС(Дата, ТаблицаИсточник,
	ИменаКолонокКПС = "КПС", ТаблицыДляЗамены = Неопределено) Экспорт
	
	ИменаКолонок = СтрРазделить(ИменаКолонокКПС, ",", Ложь);
	
	СтарыеКПС = Новый Соответствие;
	Для Каждого Строка Из ТаблицаИсточник Цикл
		Для Каждого ИмяКолонки Из ИменаКолонок Цикл
			СтарыеКПС.Вставить(Строка[ИмяКолонки])
		КонецЦикла;
	КонецЦикла;
	
	СоответствиеКПС = СоответствиеКПС(СтарыеКПС, Дата);
	
	Если ТаблицыДляЗамены = Неопределено Тогда
		ТаблицыДляЗамены = Новый Массив;
		ТаблицыДляЗамены.Добавить(ТаблицаИсточник);
	КонецЕсли;
	
	Для Каждого ТаблицаДляЗамены Из ТаблицыДляЗамены Цикл
		Для Каждого Строка Из ТаблицаДляЗамены Цикл
			Для Каждого ИмяКолонки Из ИменаКолонок Цикл
				Если СоответствиеКПС[Строка[ИмяКолонки]] <> Неопределено Тогда
					Строка[ИмяКолонки] = СоответствиеКПС[Строка[ИмяКолонки]];
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
